doc/resources/benchmark_sysbench/threads16_sysbench-tpcc-proxysql.txt
 date +%FT%TZ; \
> ./tpcc.lua --mysql-host=* --mysql-port=* --mysql-user=* --mysql-password=* \
> --mysql-db=sbt --report-interval=10 --tables=8 --scale=400 --db-driver=mysql --time=900 --threads=16  run; \
> date +%FT%TZ;
2020-04-27T02:06:58Z
sysbench 1.0.19 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 16
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 16 tps: 302.25 qps: 8829.42 (r/w/o: 4026.58/4191.95/610.89) lat (ms,95%): 104.84 err/s 1.30 reconn/s: 0.00
[ 20s ] thds: 16 tps: 300.51 qps: 8633.12 (r/w/o: 3941.80/4090.31/601.02) lat (ms,95%): 121.08 err/s 1.60 reconn/s: 0.00
[ 30s ] thds: 16 tps: 306.80 qps: 8648.34 (r/w/o: 3943.32/4091.42/613.60) lat (ms,95%): 102.97 err/s 0.90 reconn/s: 0.00
[ 40s ] thds: 16 tps: 306.30 qps: 8716.98 (r/w/o: 3973.29/4131.09/612.60) lat (ms,95%): 104.84 err/s 1.50 reconn/s: 0.00
[ 50s ] thds: 16 tps: 309.80 qps: 8825.62 (r/w/o: 4025.21/4180.81/619.60) lat (ms,95%): 106.75 err/s 1.20 reconn/s: 0.00
[ 60s ] thds: 16 tps: 308.20 qps: 8724.83 (r/w/o: 3973.71/4134.71/616.40) lat (ms,95%): 104.84 err/s 1.30 reconn/s: 0.00
[ 70s ] thds: 16 tps: 301.50 qps: 8626.58 (r/w/o: 3933.29/4090.29/603.00) lat (ms,95%): 114.72 err/s 2.00 reconn/s: 0.00
[ 80s ] thds: 16 tps: 302.50 qps: 8618.02 (r/w/o: 3929.46/4083.56/604.99) lat (ms,95%): 108.68 err/s 1.60 reconn/s: 0.00
[ 90s ] thds: 16 tps: 304.00 qps: 8743.12 (r/w/o: 3985.71/4149.41/608.00) lat (ms,95%): 108.68 err/s 1.90 reconn/s: 0.00
[ 100s ] thds: 16 tps: 299.60 qps: 8367.45 (r/w/o: 3815.68/3952.68/599.10) lat (ms,95%): 123.28 err/s 0.70 reconn/s: 0.00
[ 110s ] thds: 16 tps: 299.80 qps: 8628.89 (r/w/o: 3936.24/4092.94/599.71) lat (ms,95%): 108.68 err/s 1.00 reconn/s: 0.00
[ 120s ] thds: 16 tps: 307.70 qps: 8666.68 (r/w/o: 3955.49/4095.79/615.40) lat (ms,95%): 104.84 err/s 0.50 reconn/s: 0.00
[ 130s ] thds: 16 tps: 309.50 qps: 8798.68 (r/w/o: 4012.24/4167.44/619.01) lat (ms,95%): 104.84 err/s 1.50 reconn/s: 0.00
[ 140s ] thds: 16 tps: 298.60 qps: 8483.93 (r/w/o: 3872.27/4014.47/597.19) lat (ms,95%): 110.66 err/s 0.80 reconn/s: 0.00
[ 150s ] thds: 16 tps: 298.40 qps: 8504.69 (r/w/o: 3884.70/4023.30/596.70) lat (ms,95%): 108.68 err/s 1.80 reconn/s: 0.00
[ 160s ] thds: 16 tps: 299.30 qps: 8485.95 (r/w/o: 3878.92/4008.32/598.70) lat (ms,95%): 134.90 err/s 1.30 reconn/s: 0.00
[ 170s ] thds: 16 tps: 295.40 qps: 8409.35 (r/w/o: 3836.58/3981.98/590.80) lat (ms,95%): 137.35 err/s 1.00 reconn/s: 0.00
[ 180s ] thds: 16 tps: 307.40 qps: 8913.13 (r/w/o: 4065.57/4232.77/614.79) lat (ms,95%): 102.97 err/s 2.40 reconn/s: 0.00
[ 190s ] thds: 16 tps: 302.80 qps: 8511.60 (r/w/o: 3880.54/4025.45/605.61) lat (ms,95%): 112.67 err/s 0.80 reconn/s: 0.00
[ 200s ] thds: 16 tps: 305.70 qps: 8516.54 (r/w/o: 3879.07/4026.07/611.40) lat (ms,95%): 125.52 err/s 1.30 reconn/s: 0.00
[ 210s ] thds: 16 tps: 306.10 qps: 8723.62 (r/w/o: 3970.91/4140.61/612.10) lat (ms,95%): 106.75 err/s 1.10 reconn/s: 0.00
[ 220s ] thds: 16 tps: 295.40 qps: 8563.59 (r/w/o: 3899.59/4073.09/590.90) lat (ms,95%): 158.63 err/s 0.90 reconn/s: 0.00
[ 230s ] thds: 16 tps: 298.10 qps: 8562.16 (r/w/o: 3909.53/4057.03/595.60) lat (ms,95%): 125.52 err/s 0.80 reconn/s: 0.00
[ 240s ] thds: 16 tps: 303.30 qps: 8615.90 (r/w/o: 3928.70/4080.00/607.20) lat (ms,95%): 106.75 err/s 2.00 reconn/s: 0.00
[ 250s ] thds: 16 tps: 304.90 qps: 8701.66 (r/w/o: 3974.73/4117.13/609.80) lat (ms,95%): 104.84 err/s 1.00 reconn/s: 0.00
[ 260s ] thds: 16 tps: 299.80 qps: 8516.15 (r/w/o: 3882.38/4034.17/599.60) lat (ms,95%): 110.66 err/s 1.40 reconn/s: 0.00
[ 270s ] thds: 16 tps: 296.90 qps: 8415.21 (r/w/o: 3842.81/3978.71/593.70) lat (ms,95%): 106.75 err/s 0.90 reconn/s: 0.00
[ 280s ] thds: 16 tps: 298.80 qps: 8587.87 (r/w/o: 3918.18/4071.98/597.70) lat (ms,95%): 108.68 err/s 1.20 reconn/s: 0.00
[ 290s ] thds: 16 tps: 293.50 qps: 8402.19 (r/w/o: 3835.80/3979.40/587.00) lat (ms,95%): 137.35 err/s 1.40 reconn/s: 0.00
[ 300s ] thds: 16 tps: 302.00 qps: 8455.41 (r/w/o: 3856.76/3994.66/603.99) lat (ms,95%): 110.66 err/s 1.50 reconn/s: 0.00
[ 310s ] thds: 16 tps: 293.10 qps: 8410.56 (r/w/o: 3834.13/3990.23/586.20) lat (ms,95%): 118.92 err/s 1.50 reconn/s: 0.00
[ 320s ] thds: 16 tps: 303.30 qps: 8430.32 (r/w/o: 3847.11/3976.61/606.60) lat (ms,95%): 112.67 err/s 1.20 reconn/s: 0.00
[ 330s ] thds: 16 tps: 297.90 qps: 8396.02 (r/w/o: 3822.31/3977.91/595.80) lat (ms,95%): 114.72 err/s 1.90 reconn/s: 0.00
[ 340s ] thds: 16 tps: 306.80 qps: 8542.87 (r/w/o: 3895.39/4033.88/613.60) lat (ms,95%): 110.66 err/s 1.60 reconn/s: 0.00
[ 350s ] thds: 16 tps: 292.30 qps: 8199.35 (r/w/o: 3742.92/3871.82/584.60) lat (ms,95%): 130.13 err/s 1.50 reconn/s: 0.00
[ 360s ] thds: 16 tps: 293.80 qps: 8506.86 (r/w/o: 3885.58/4033.88/587.40) lat (ms,95%): 118.92 err/s 0.80 reconn/s: 0.00
[ 370s ] thds: 16 tps: 303.80 qps: 8447.62 (r/w/o: 3856.91/3982.91/607.80) lat (ms,95%): 106.75 err/s 0.80 reconn/s: 0.00
[ 380s ] thds: 16 tps: 296.90 qps: 8308.13 (r/w/o: 3791.31/3923.01/593.80) lat (ms,95%): 125.52 err/s 0.70 reconn/s: 0.00
[ 390s ] thds: 16 tps: 312.80 qps: 8752.35 (r/w/o: 3992.72/4134.02/625.60) lat (ms,95%): 106.75 err/s 1.30 reconn/s: 0.00
[ 400s ] thds: 16 tps: 297.60 qps: 8609.94 (r/w/o: 3924.82/4089.92/595.20) lat (ms,95%): 108.68 err/s 1.40 reconn/s: 0.00
[ 410s ] thds: 16 tps: 304.70 qps: 8508.60 (r/w/o: 3876.00/4023.20/609.40) lat (ms,95%): 123.28 err/s 1.10 reconn/s: 0.00
[ 420s ] thds: 16 tps: 300.50 qps: 8449.96 (r/w/o: 3855.38/3993.58/601.00) lat (ms,95%): 112.67 err/s 1.00 reconn/s: 0.00
[ 430s ] thds: 16 tps: 295.50 qps: 8434.75 (r/w/o: 3844.08/3999.78/590.90) lat (ms,95%): 121.08 err/s 0.90 reconn/s: 0.00
[ 440s ] thds: 16 tps: 301.60 qps: 8577.54 (r/w/o: 3903.12/4071.12/603.30) lat (ms,95%): 114.72 err/s 1.30 reconn/s: 0.00
[ 450s ] thds: 16 tps: 300.90 qps: 8605.46 (r/w/o: 3923.38/4080.28/601.80) lat (ms,95%): 125.52 err/s 1.10 reconn/s: 0.00
[ 460s ] thds: 16 tps: 293.90 qps: 8448.34 (r/w/o: 3864.32/3996.22/587.80) lat (ms,95%): 139.85 err/s 2.00 reconn/s: 0.00
[ 470s ] thds: 16 tps: 296.90 qps: 8431.20 (r/w/o: 3851.60/3985.80/593.80) lat (ms,95%): 158.63 err/s 1.00 reconn/s: 0.00
[ 480s ] thds: 16 tps: 308.10 qps: 8655.71 (r/w/o: 3942.30/4097.20/616.20) lat (ms,95%): 112.67 err/s 2.20 reconn/s: 0.00
[ 490s ] thds: 16 tps: 300.20 qps: 8562.21 (r/w/o: 3906.86/4054.96/600.39) lat (ms,95%): 108.68 err/s 1.50 reconn/s: 0.00
[ 500s ] thds: 16 tps: 293.90 qps: 8376.37 (r/w/o: 3819.59/3968.99/587.80) lat (ms,95%): 142.39 err/s 0.80 reconn/s: 0.00
[ 510s ] thds: 16 tps: 302.40 qps: 8559.03 (r/w/o: 3898.12/4056.12/604.80) lat (ms,95%): 108.68 err/s 1.40 reconn/s: 0.00
[ 520s ] thds: 16 tps: 294.40 qps: 8496.30 (r/w/o: 3869.90/4037.60/588.80) lat (ms,95%): 132.49 err/s 1.30 reconn/s: 0.00
[ 530s ] thds: 16 tps: 297.40 qps: 8530.71 (r/w/o: 3888.01/4047.91/594.80) lat (ms,95%): 106.75 err/s 1.00 reconn/s: 0.00
[ 540s ] thds: 16 tps: 298.70 qps: 8568.43 (r/w/o: 3914.87/4056.17/597.40) lat (ms,95%): 112.67 err/s 2.30 reconn/s: 0.00
[ 550s ] thds: 16 tps: 300.40 qps: 8744.48 (r/w/o: 3996.44/4147.54/600.51) lat (ms,95%): 104.84 err/s 1.40 reconn/s: 0.00
[ 560s ] thds: 16 tps: 296.60 qps: 8424.40 (r/w/o: 3855.40/3975.50/593.50) lat (ms,95%): 114.72 err/s 1.30 reconn/s: 0.00
[ 570s ] thds: 16 tps: 301.60 qps: 8850.32 (r/w/o: 4040.61/4206.51/603.20) lat (ms,95%): 112.67 err/s 1.60 reconn/s: 0.00
[ 580s ] thds: 16 tps: 301.60 qps: 8359.87 (r/w/o: 3813.89/3942.79/603.20) lat (ms,95%): 123.28 err/s 0.80 reconn/s: 0.00
[ 590s ] thds: 16 tps: 305.30 qps: 8604.16 (r/w/o: 3921.03/4072.53/610.60) lat (ms,95%): 121.08 err/s 1.90 reconn/s: 0.00
[ 600s ] thds: 16 tps: 299.30 qps: 8358.46 (r/w/o: 3812.38/3947.48/598.60) lat (ms,95%): 121.08 err/s 0.60 reconn/s: 0.00
[ 610s ] thds: 16 tps: 298.70 qps: 8484.74 (r/w/o: 3868.37/4018.97/597.40) lat (ms,95%): 110.66 err/s 1.60 reconn/s: 0.00
[ 620s ] thds: 16 tps: 308.40 qps: 8652.69 (r/w/o: 3945.29/4090.59/616.80) lat (ms,95%): 108.68 err/s 1.60 reconn/s: 0.00
[ 630s ] thds: 16 tps: 314.10 qps: 8940.34 (r/w/o: 4090.02/4222.12/628.20) lat (ms,95%): 102.97 err/s 1.60 reconn/s: 0.00
[ 640s ] thds: 16 tps: 309.20 qps: 8663.37 (r/w/o: 3952.69/4092.29/618.40) lat (ms,95%): 106.75 err/s 1.70 reconn/s: 0.00
[ 650s ] thds: 16 tps: 290.70 qps: 8369.85 (r/w/o: 3819.82/3968.62/581.40) lat (ms,95%): 127.81 err/s 1.10 reconn/s: 0.00
[ 660s ] thds: 16 tps: 304.10 qps: 8648.64 (r/w/o: 3945.27/4095.17/608.20) lat (ms,95%): 104.84 err/s 1.00 reconn/s: 0.00
[ 670s ] thds: 16 tps: 301.40 qps: 8512.93 (r/w/o: 3884.51/4025.61/602.80) lat (ms,95%): 118.92 err/s 1.40 reconn/s: 0.00
[ 680s ] thds: 16 tps: 295.70 qps: 8366.06 (r/w/o: 3827.58/3947.08/591.40) lat (ms,95%): 139.85 err/s 1.70 reconn/s: 0.00
[ 690s ] thds: 16 tps: 294.60 qps: 8349.69 (r/w/o: 3801.44/3959.04/589.21) lat (ms,95%): 121.08 err/s 2.20 reconn/s: 0.00
[ 700s ] thds: 16 tps: 302.90 qps: 8527.17 (r/w/o: 3885.09/4036.29/605.80) lat (ms,95%): 110.66 err/s 1.10 reconn/s: 0.00
[ 710s ] thds: 16 tps: 301.10 qps: 8612.25 (r/w/o: 3930.98/4079.08/602.20) lat (ms,95%): 108.68 err/s 1.60 reconn/s: 0.00
[ 720s ] thds: 16 tps: 294.10 qps: 8314.27 (r/w/o: 3787.58/3938.48/588.20) lat (ms,95%): 144.97 err/s 1.70 reconn/s: 0.00
[ 730s ] thds: 16 tps: 299.30 qps: 8290.18 (r/w/o: 3789.54/3902.34/598.31) lat (ms,95%): 116.80 err/s 1.30 reconn/s: 0.00
[ 740s ] thds: 16 tps: 298.60 qps: 8449.20 (r/w/o: 3847.90/4003.80/597.50) lat (ms,95%): 125.52 err/s 1.50 reconn/s: 0.00
[ 750s ] thds: 16 tps: 311.30 qps: 8718.63 (r/w/o: 3964.91/4131.11/622.60) lat (ms,95%): 104.84 err/s 1.40 reconn/s: 0.00
[ 760s ] thds: 16 tps: 291.10 qps: 8063.74 (r/w/o: 3670.47/3811.07/582.20) lat (ms,95%): 161.51 err/s 1.10 reconn/s: 0.00
[ 770s ] thds: 16 tps: 292.00 qps: 8321.01 (r/w/o: 3796.60/3940.40/584.00) lat (ms,95%): 123.28 err/s 1.00 reconn/s: 0.00
[ 780s ] thds: 16 tps: 297.90 qps: 8576.54 (r/w/o: 3912.42/4068.32/595.80) lat (ms,95%): 112.67 err/s 0.90 reconn/s: 0.00
[ 790s ] thds: 16 tps: 296.00 qps: 8401.88 (r/w/o: 3837.59/3972.29/592.00) lat (ms,95%): 125.52 err/s 1.60 reconn/s: 0.00
[ 800s ] thds: 16 tps: 293.80 qps: 8378.32 (r/w/o: 3822.76/3967.96/587.61) lat (ms,95%): 116.80 err/s 1.60 reconn/s: 0.00
[ 810s ] thds: 16 tps: 294.39 qps: 8417.53 (r/w/o: 3839.82/3989.02/588.69) lat (ms,95%): 134.90 err/s 1.80 reconn/s: 0.00
[ 820s ] thds: 16 tps: 291.70 qps: 8514.34 (r/w/o: 3880.92/4049.92/583.50) lat (ms,95%): 127.81 err/s 1.70 reconn/s: 0.00
[ 830s ] thds: 16 tps: 305.90 qps: 8758.02 (r/w/o: 3987.71/4158.51/611.80) lat (ms,95%): 108.68 err/s 1.40 reconn/s: 0.00
[ 840s ] thds: 16 tps: 287.80 qps: 8374.41 (r/w/o: 3821.51/3977.41/575.50) lat (ms,95%): 127.81 err/s 1.90 reconn/s: 0.00
[ 850s ] thds: 16 tps: 295.20 qps: 8490.66 (r/w/o: 3886.48/4013.68/590.50) lat (ms,95%): 114.72 err/s 1.10 reconn/s: 0.00
[ 860s ] thds: 16 tps: 299.10 qps: 8620.10 (r/w/o: 3932.85/4089.05/598.21) lat (ms,95%): 121.08 err/s 1.10 reconn/s: 0.00
[ 870s ] thds: 16 tps: 298.80 qps: 8638.07 (r/w/o: 3946.29/4094.19/597.60) lat (ms,95%): 114.72 err/s 1.10 reconn/s: 0.00
[ 880s ] thds: 16 tps: 304.70 qps: 8661.30 (r/w/o: 3958.00/4093.90/609.40) lat (ms,95%): 108.68 err/s 1.00 reconn/s: 0.00
[ 890s ] thds: 16 tps: 295.80 qps: 8202.33 (r/w/o: 3728.91/3881.81/591.60) lat (ms,95%): 173.58 err/s 1.30 reconn/s: 0.00
[ 900s ] thds: 16 tps: 302.30 qps: 8547.89 (r/w/o: 3898.15/4045.15/604.59) lat (ms,95%): 121.08 err/s 1.40 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            3504354
        write:                           3637463
        other:                           540636
        total:                           7682453
    transactions:                        270294 (300.27 per sec.)
    queries:                             7682453 (8534.42 per sec.)
    ignored errors:                      1203   (1.34 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          900.1721s
    total number of events:              270294

Latency (ms):
         min:                                    1.87
         avg:                                   53.28
         max:                                  499.33
         95th percentile:                      114.72
         sum:                             14400255.08

Threads fairness:
    events (avg/stddev):           16893.3750/175.32
    execution time (avg/stddev):   900.0159/0.05

2020-04-27T02:21:58Z